--------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\palmertm\Documents\all\work\mregger\code/mreggersimex_cscript.log
  log type:  text
 opened on:  23 Jul 2017, 14:06:16

. do "`filepath'/`name'.do"

. * cscript for mreggersimex
. * 23jul2017
. 
. cscript
-------------------------------------------------------------------------BEGIN 

. 
. which mreggersimex
.\mreggersimex.ado
*! 0.1.0 20jul2017 Tom Palmer

. which mreggersimexonce
.\mreggersimexonce.ado
*! 0.1.0 23jul2017 Tom Palmer

. 
. clear all

. mata mata desc

      # bytes   type                        name and extent
-------------------------------------------------------------------------------
-------------------------------------------------------------------------------

. 
. use dodata, clear

. 
. gen byte sel1 = (ldlcp2 < 1e-8)

. 
. mreggersimex chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, ///
>         gxse(ldlcse) seed(12345)
(running mreggersimexonce on estimation sample)

Bootstrap replications (50)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50

                                                      Number of genotypes = 73
                                                   Bootstrap replications = 50
                                                 Simulation replications = 100
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       slope |   .6256194   .1028357     6.08   0.000      .424065    .8271737
       _cons |  -.0089987   .0053415    -1.68   0.092    -.0194678    .0014704
------------------------------------------------------------------------------

. 
. mreggersimex chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, ///
>         gxse(ldlcse) seed(12345) simreps(20) reps(3)
(running mreggersimexonce on estimation sample)

Bootstrap replications (3)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
...

                                                      Number of genotypes = 73
                                                    Bootstrap replications = 3
                                                  Simulation replications = 20
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       slope |   .6396257   .0485306    13.18   0.000     .5445074     .734744
       _cons |   -.009941   .0061239    -1.62   0.105    -.0219436    .0020616
------------------------------------------------------------------------------

. 
. mreggersimex chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, ///
>         gxse(ldlcse) seed(12345) simreps(10)
(running mreggersimexonce on estimation sample)

Bootstrap replications (50)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50

                                                      Number of genotypes = 73
                                                   Bootstrap replications = 50
                                                  Simulation replications = 10
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       slope |   .6047862    .118298     5.11   0.000     .3729264     .836646
       _cons |  -.0079552   .0056635    -1.40   0.160    -.0190555    .0031452
------------------------------------------------------------------------------

. 
. mreggersimex chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, ///
>         gxse(ldlcse) seed(12345) simreps(10) nodraw noboot

                                                      Number of genotypes = 73
                                                    Bootstrap replications = 0
                                                  Simulation replications = 10
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       slope |   .6047862          .        .       .            .           .
       _cons |  -.0079552          .        .       .            .           .
------------------------------------------------------------------------------

. mreggersimex

                                                      Number of genotypes = 73
                                                    Bootstrap replications = 0
                                                  Simulation replications = 10
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       slope |   .6047862          .        .       .            .           .
       _cons |  -.0079552          .        .       .            .           .
------------------------------------------------------------------------------

. 
. mreggersimex chdbeta ldlcbeta [aw=1/chdse^2] if sel1==1, ///
>         gxse(ldlcse) seed(12345) simreps(10) nodraw
(running mreggersimexonce on estimation sample)

Bootstrap replications (50)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50

                                                      Number of genotypes = 73
                                                   Bootstrap replications = 50
                                                  Simulation replications = 10
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       slope |   .6047862    .118298     5.11   0.000     .3729264     .836646
       _cons |  -.0079552   .0056635    -1.40   0.160    -.0190555    .0031452
------------------------------------------------------------------------------

. 
end of do-file

. log close
      name:  <unnamed>
       log:  C:\Users\palmertm\Documents\all\work\mregger\code/mreggersimex_csc
> ript.log
  log type:  text
 closed on:  23 Jul 2017, 14:19:03
-------------------------------------------------------------------------------
